### The goal of this notebook is to send querry to retrieve the information about students who scored a 4 and above on their algebra exam.

In [1]:
import sqlite3
import pandas as pd

In [2]:
# conecto with database

In [3]:
connect = sqlite3.connect("../database/db.db")
cursor = connect.cursor()

In [4]:
# construct querry

In [17]:
querry = (
"""
SELECT * FROM exam_results
INNER JOIN students ON exam_results.student_id = students.student_id
INNER JOIN class_catalogue ON exam_results.class_id = class_catalogue.class_id
WHERE exam_results.grade >= 4 AND class_catalogue.class_name = 'algebra'
""")

In [18]:
full_data = pd.read_sql_query(querry, con=connect)

In [19]:
full_data

,id,student_id,class_id,exam_date,grade,id,student_id,name,surname,birth_date,faculty,id,class_id,class_name,professor_id,semester
0,3,34578,6743,2019-06-19,4.5,2,34578,Kate,Smith,1992-10-29,Economy,1,6743,algebra,4352,2019_summer

In [20]:
full_data[["name", "surname"]]

   name surname
0  Kate   Smith